src/cf/src/Documents/СверкаВзаиморасчётов/СверкаВзаиморасчётов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СверкаВзаиморасчётов</name>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйОстаток</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальныйОстаток</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Расходждение</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧПоДаннымОрганизации</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыСКонтрагентами</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРегистратор</name>
      <type>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ВозвратПоставщику</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.ВозвратОтПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПредставление</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Дебет</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Кредит</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>НесколькоСтавокНДС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РасшифровкаНДС</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧПоДаннымКонтрагента</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыСКонтрагентами</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРегистратор</name>
      <type>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ВозвратПоставщику</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.ВозвратОтПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПредставление</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Дебет</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Кредит</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/AccumulationRegisters/ВзаиморасчётыСПоставщиками/ВзаиморасчётыСПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчётыСПоставщиками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчётов</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеДополнительныхРасходов</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Enums/НазначенияРассылок/НазначенияРассылок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияРассылок</name>
  <enumValues>
    <name>Руководство</name>
  </enumValues>
  <enumValues>
    <name>Бухгалтерия</name>
  </enumValues>
  <enumValues>
    <name>ОтделЗакупок</name>
  </enumValues>
  <enumValues>
    <name>ОтделПродаж</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/ДоговорыСКонтрагентами/ДоговорыСКонтрагентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыСКонтрагентами</name>
  <attributes>
    <name>БанковскийСчёт</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчётКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчётов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчётыВУсловныхЕдиницах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчётаОтсрочки</name>
    <type>
      <types>EnumRef.СпособыРасчётаОтсрочки</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКредита</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/ChartsOfCharacteristicTypes/ВидыРеквизитовКонтрагентов/ВидыРеквизитовКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыРеквизитовКонтрагентов</name>
  <type>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <numberQualifiers>
      <precision>9</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>500</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Адреса</name>
      <description>Adresses</description>
    </items>
    <items>
      <name>Контакты</name>
      <description>Contacts</description>
    </items>
    <items>
      <name>РегистрационныеДанные</name>
      <description>Données officielles</description>
    </items>
    <items>
      <name>КонтактныеЛица</name>
      <description>Personnes de contact</description>
    </items>
    <items>
      <name>НаименованиеПолное</name>
      <description>Наименование полное</description>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>Периодический</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Множественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧВидыКонтрагентов</name>
    <comment>Для каких контрагентов доступен реквизит</comment>
    <attributes>
      <name>ВидКонтрагента</name>
      <type>
        <types>EnumRef.ВидыКонтрагентов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

src/cf/src/Documents/СверкаВзаиморасчётов/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Перечисляет печатные формы объекта.
// См. ПечатныеФормы.НоваяКоллекцияКомандПечати
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - пополняемая коллекция команд печати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	Команда = КомандыПечати.Добавить();
	Команда.ИмяМакета = "АктСверки";
	Команда.Представление = НСтр("ru = 'Акт сверки'; fr = 'Acte de rapprochement';
		|en = 'Reconciliation act'; es = 'Acta de conciliación'");

	Команда = КомандыПечати.Добавить();
	Команда.ИмяМакета = "АктСверкиСПечатью";
	Команда.Представление = НСтр("ru = 'Акт сверки с печатью'; fr = 'Acte de rapprochement avec cachet';
		|en = 'Reconciliation act with stamp'; es = 'Acta de conciliación con sello'");

	Команда = КомандыПечати.Добавить();
	Команда.ИмяМакета = "АктСверкиБезНДС";
	Команда.Представление = НСтр("ru = 'Акт сверки без НДС'; fr = 'Acte de rapprochement hors TVA';
		|en = 'Reconciliation act without VAT'; es = 'Acta de conciliación sin IVA'");

КонецПроцедуры

// Формирует запрошенные печатные формы.
// См. ПечатныеФормы.СформироватьПечатныеФормы
//
// Параметры:
//  МассивОбъектов        - Массив          - печатаемые объекты
//  ПараметрыПечати       - Структура       - параметры команды печати
//  КоллекцияПечатныхФорм - ТаблицаЗначений - заполняемая коллекция печатных форм
//  ОбъектыПечати         - СписокЗначений  - соответствие объектов областям печати
//  ПараметрыВывода       - Структура       - параметры окна печати
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСверки") Тогда
		Таб = Новый ТабличныйДокумент;
		Для Каждого Док Из МассивОбъектов Цикл
			НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
			ПечатьАктСверки(Док, Таб, Ложь);
			ПечатныеФормы.ЗадатьОбластьПечати(Таб, НомерСтрокиНачало, ОбъектыПечати, Док);
		КонецЦикла;
		ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, "АктСверки",
			НСтр("ru = 'Акт сверки'; fr = 'Acte de rapprochement';
			|en = 'Reconciliation act'; es = 'Acta de conciliación'"),
			Таб, "Документ.СверкаВзаиморасчётов.АктСверки");
	КонецЕсли;

	Если ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСверкиСПечатью") Тогда
		Таб = Новый ТабличныйДокумент;
		Для Каждого Док Из МассивОбъектов Цикл
			НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
			ПечатьАктСверки(Док, Таб, Истина);
			ПечатныеФормы.ЗадатьОбластьПечати(Таб, НомерСтрокиНачало, ОбъектыПечати, Док);
		КонецЦикла;
		ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, "АктСверкиСПечатью",
			НСтр("ru = 'Акт сверки с печатью'; fr = 'Acte de rapprochement avec cachet';
			|en = 'Reconciliation act with stamp'; es = 'Acta de conciliación con sello'"),
			Таб, "Документ.СверкаВзаиморасчётов.АктСверки");
	КонецЕсли;

	Если ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктСверкиБезНДС") Тогда
		Таб = Новый ТабличныйДокумент;
		Для Каждого Док Из МассивОбъектов Цикл
			НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
			ПечатьАктСверкиБезНДС(Док, Таб);
			ПечатныеФормы.ЗадатьОбластьПечати(Таб, НомерСтрокиНачало, ОбъектыПечати, Док);
		КонецЦикла;
		ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, "АктСверкиБезНДС",
			НСтр("ru = 'Акт сверки без НДС'; fr = 'Acte de rapprochement hors TVA';
			|en = 'Reconciliation act without VAT'; es = 'Acta de conciliación sin IVA'"),
			Таб, "Документ.СверкаВзаиморасчётов.АктСверкиБезНДС");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Печать

Процедура ПечатьАктСверки(Док, Таб, ВыводитьПечать = Ложь) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ТолькоПросмотр = Истина;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.МасштабПечати = 85;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_АктСверки_АктСверки";
	// Получаем данные
	Валюта = Справочники.Валюты.MoroccanDirham;
	КарточкаОрганизации = Справочники.Контрагенты.ПолучитьКарточку(Док.Организация, Док.Дата, Истина);
	КарточкаКонтрагента = Справочники.Контрагенты.ПолучитьКарточку(Док.Контрагент, Док.Дата);
	Макет = ПечатныеФормы.МакетПечатнойФормы("Документ.СверкаВзаиморасчётов.АктСверки");	
	оШапка = Макет.ПолучитьОбласть("Шапка|Главная");
	оСтрока = Макет.ПолучитьОбласть("Строка|Главная");
	оОборотыИтог = Макет.ПолучитьОбласть("ОборотыИтог|Главная");
	оПодвал = Макет.ПолучитьОбласть("Подвал|Главная");
	оШапкаНДС = Макет.ПолучитьОбласть("Шапка|НДС");
	оСтрокаНДС = Макет.ПолучитьОбласть("Строка|НДС");
	оОборотыИтогНДС = Макет.ПолучитьОбласть("ОборотыИтог|НДС");
	оПодвалНДС = Макет.ПолучитьОбласть("Подвал|НДС");
	// Шапка
	оШапка.Параметры.Номер = Док.Номер;
	оШапка.Параметры.Дата = Формат(Док.Дата, "ДФ=dd.MM.yyyy");
	оШапка.Параметры.НачалоПериода = Формат(Док.НачалоПериода,"ДЛФ=DD");
	оШапка.Параметры.КонецПериода = Формат(Док.КонецПериода,"ДЛФ=DD");
	оШапка.Параметры.Организация = Док.Организация;
	оШапка.Параметры.Должность = КарточкаОрганизации.Руководитель.Должность;
	оШапка.Параметры.Руководитель = КарточкаОрганизации.Руководитель.ДляПечати;
	оШапка.Параметры.Контрагент = КарточкаКонтрагента.НаименованиеПолное;
	оШапка.Параметры.КонтрагентДолжность = КарточкаКонтрагента.Руководитель.Должность;
	оШапка.Параметры.КонтрагентРуководитель = КарточкаКонтрагента.Руководитель.ДляПечати;
	оШапка.Параметры.НачальныйОстатокДт = ?(Док.НачальныйОстаток > 0, Док.НачальныйОстаток, 0);
	оШапка.Параметры.НачальныйОстатокКт = ?(Док.НачальныйОстаток < 0, -Док.НачальныйОстаток, 0);	
	Таб.Вывести(оШапка);
	ТЗНдс = Новый ТаблицаЗначений;
	ТЗНдс.Колонки.Добавить("НомерСтроки");
	ТЗНдс.Колонки.Добавить("СтавкаНДС");
	ТЗНдс.Колонки.Добавить("СуммаНДС");
	Для Каждого Стр Из Док.ТЧПоДаннымОрганизации Цикл
		Если Стр.НесколькоСтавокНДС Тогда 
			ТЗ = ОбщегоНазначенияКлиентСервер.КонвертироватьИзJSON(Стр.РасшифровкаНДС, Ложь);
			Для Каждого СтрТЗ из ТЗ Цикл 
				НС = ТЗНдс.Добавить();
				НС.НомерСтроки = Стр.НомерСтроки;
				НС.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоРеквизиту("Ставка",СтрТЗ.СтавкаНДС);
				НС.СуммаНДС = СтрТЗ.СуммаНДС;
			КонецЦикла;
		Иначе
			НС = ТЗНдс.Добавить();
			НС.НомерСтроки = Стр.НомерСтроки;
			НС.СтавкаНДС = Стр.СтавкаНДС;
			НС.СуммаНДС = Стр.СуммаНДС;
		КонецЕсли;
	КонецЦикла;
	ТЗСтавкиНДС = ТЗНдс.Скопировать();
	ТЗСтавкиНДС.Свернуть("СтавкаНДС","СуммаНДС");
	ТЗСтавкиНДС.Сортировать("СтавкаНДС");
	Для Каждого СтрТЗСтавкиНДС из ТЗСтавкиНДС Цикл
		оШапкаНДС.Параметры.СтавкаНДС = "НДС "+СокрЛП(СтрТЗСтавкиНДС.СтавкаНДС);
		Таб.Присоединить(оШапкаНДС);
	КонецЦикла;
	// Строки
	Для Каждого Стр Из Док.ТЧПоДаннымОрганизации Цикл
		оСтрока.Параметры.Заполнить(Стр);
		Таб.Вывести(оСтрока);
		Для Каждого СтрТЗСтавкиНДС из ТЗСтавкиНДС Цикл
			МасСтрокНДС = ТЗНдс.НайтиСтроки(Новый Структура("НомерСтроки,СтавкаНДС",Стр.НомерСтроки,СтрТЗСтавкиНДС.СтавкаНДС));
			оСтрокаНДС.Параметры.СуммаНДС = ?(МасСтрокНДС.Количество() = 0, 0, МасСтрокНДС.Получить(0).СуммаНДС);
			Таб.Присоединить(оСтрокаНДС);
		КонецЦикла;
	КонецЦикла;
	// Обороты
	оОборотыИтог.Параметры.СуммаРасход = Док.ТЧПоДаннымОрганизации.Итог("Кредит");
	оОборотыИтог.Параметры.СуммаПриход = Док.ТЧПоДаннымОрганизации.Итог("Дебет");
	Таб.Вывести(оОборотыИтог);
	Для Каждого СтрТЗСтавкиНДС из ТЗСтавкиНДС Цикл
		оОборотыИтогНДС.Параметры.СуммаНДС = СтрТЗСтавкиНДС.СуммаНДС;
		Таб.Присоединить(оОборотыИтогНДС);
	КонецЦикла;
	// Подвал
	КонечныйОстатокДт = ?(Док.КонечныйОстаток > 0, Док.КонечныйОстаток, 0);
	КонечныйОстатокКт = ?(Док.КонечныйОстаток < 0, -Док.КонечныйОстаток, 0);
	оПодвал.Параметры.КонецПериода = Формат(Док.КонецПериода,"ДЛФ=DD");
	оПодвал.Параметры.КонечныйОстатокДт = КонечныйОстатокДт;
	оПодвал.Параметры.КонечныйОстатокКт = КонечныйОстатокКт;
	оПодвал.Параметры.Организация = КарточкаОрганизации.Представление;
	оПодвал.Параметры.Должность = КарточкаОрганизации.Руководитель.Должность;
	оПодвал.Параметры.Руководитель = КарточкаОрганизации.Руководитель.ДляПечати;
	оПодвал.Параметры.Контрагент = КарточкаКонтрагента.Представление;
	оПодвал.Параметры.КонтрагентДолжность = КарточкаКонтрагента.Руководитель.Должность;
	оПодвал.Параметры.КонтрагентРуководитель = КарточкаКонтрагента.Руководитель.ДляПечати;
	Если КонечныйОстатокКт > 0 Тогда
		ТекстСверки = "2. Долг " + Док.Организация + " в валюте " + Валюта + " " + 
				КонечныйОстатокКт + " (" + Справочники.Валюты.СформироватьСуммуПрописью(КонечныйОстатокКт, Валюта, Перечисления.Локализации.fr_CA) + ")";
	ИначеЕсли КонечныйОстатокДт > 0 Тогда
		ТекстСверки = "2. Долг " + КарточкаКонтрагента.НаименованиеПолное + " в валюте " + Валюта + " " + 
				КонечныйОстатокДт + " (" + Справочники.Валюты.СформироватьСуммуПрописью(КонечныйОстатокДт, Валюта, Перечисления.Локализации.fr_CA) + ")";
	Иначе
		ТекстСверки = "2. Задолженность отсутствует."
	Конецесли;
	оПодвал.Параметры.ИтогСверки = ТекстСверки;
	Если ВыводитьПечать Тогда
		ДиаметрПечати = Док.Организация.ПечатьОрганизацииДиаметр;		
		оПечать = оПодвал.Рисунки.Печать;
		оПечать.Картинка = Новый Картинка(Док.Организация.ПечатьОрганизации.Получить());
		ВыводПечатныхФорм.РассчитатьРазмерИРасположениеКартинки(оПечать, ДиаметрПечати, ДиаметрПечати, 50, 0, Таб.МасштабПечати);		
		Если ЗначениеЗаполнено(КарточкаОрганизации.Руководитель.ОтветственноеЛицо) Тогда		
			ОЛ = КарточкаОрганизации.Руководитель.ОтветственноеЛицо;
			оПодписьРуководителя = оПодвал.Рисунки.Подпись;
			оПодписьРуководителя.Картинка = Новый Картинка(ОЛ.Подпись.Получить());			
			ВыводПечатныхФорм.РассчитатьРазмерИРасположениеКартинки(оПодписьРуководителя, ОЛ.ПодписьШирина, ОЛ.ПодписьВысота, 30, 20, Таб.МасштабПечати);
		КонецЕсли;
	КонецЕсли;
	Таб.Вывести(оПодвал); 	
	Для Каждого СтрТЗСтавкиНДС из ТЗСтавкиНДС Цикл
		Таб.Присоединить(оПодвалНДС);
	КонецЦикла;
КонецПроцедуры

Процедура ПечатьАктСверкиБезНДС(Док, Таб, ВыводитьПечать = Ложь) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ТолькоПросмотр = Истина;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.МасштабПечати = 85;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_АктСверки_АктСверки_БезНДС";
	// Получаем данные
	Валюта = Справочники.Валюты.MoroccanDirham;
	КарточкаОрганизации = Справочники.Контрагенты.ПолучитьКарточку(Док.Организация, Док.Дата, Истина);
	КарточкаКонтрагента = Справочники.Контрагенты.ПолучитьКарточку(Док.Контрагент, Док.Дата);
	Макет = ПечатныеФормы.МакетПечатнойФормы("Документ.СверкаВзаиморасчётов.АктСверкиБезНДС");	
	оШапка = Макет.ПолучитьОбласть("Шапка");
	оСтрока = Макет.ПолучитьОбласть("Строка");
	оОборотыИтог = Макет.ПолучитьОбласть("ОборотыИтог");
	оПодвал = Макет.ПолучитьОбласть("Подвал");
	// Шапка
	оШапка.Параметры.Номер = Док.Номер;
	оШапка.Параметры.Дата = Формат(Док.Дата, "ДФ=dd.MM.yyyy");
	оШапка.Параметры.НачалоПериода = Формат(Док.НачалоПериода,"ДЛФ=DD");
	оШапка.Параметры.КонецПериода = Формат(Док.КонецПериода,"ДЛФ=DD");
	оШапка.Параметры.Организация = Док.Организация;
	оШапка.Параметры.Должность = КарточкаОрганизации.Руководитель.Должность;
	оШапка.Параметры.Руководитель = КарточкаОрганизации.Руководитель.ДляПечати;
	оШапка.Параметры.Контрагент = КарточкаКонтрагента.НаименованиеПолное;
	оШапка.Параметры.КонтрагентДолжность = КарточкаКонтрагента.Руководитель.Должность;
	оШапка.Параметры.КонтрагентРуководитель = КарточкаКонтрагента.Руководитель.ДляПечати;
	оШапка.Параметры.НачальныйОстатокДт = ?(Док.НачальныйОстаток > 0, Док.НачальныйОстаток, 0);
	оШапка.Параметры.НачальныйОстатокКт = ?(Док.НачальныйОстаток < 0, -Док.НачальныйОстаток, 0);	
	Таб.Вывести(оШапка);
	// Строки
	Для Каждого Стр Из Док.ТЧПоДаннымОрганизации Цикл
		оСтрока.Параметры.Заполнить(Стр);
		Таб.Вывести(оСтрока);
	КонецЦикла;
	// Обороты
	оОборотыИтог.Параметры.СуммаРасход = Док.ТЧПоДаннымОрганизации.Итог("Кредит");
	оОборотыИтог.Параметры.СуммаПриход = Док.ТЧПоДаннымОрганизации.Итог("Дебет");
	Таб.Вывести(оОборотыИтог);
	// Подвал
	КонечныйОстатокДт = ?(Док.КонечныйОстаток > 0, Док.КонечныйОстаток, 0);
	КонечныйОстатокКт = ?(Док.КонечныйОстаток < 0, -Док.КонечныйОстаток, 0);
	оПодвал.Параметры.КонецПериода = Формат(Док.КонецПериода,"ДЛФ=DD");
	оПодвал.Параметры.КонечныйОстатокДт = КонечныйОстатокДт;
	оПодвал.Параметры.КонечныйОстатокКт = КонечныйОстатокКт;
	оПодвал.Параметры.Организация = КарточкаОрганизации.Представление;
	оПодвал.Параметры.Должность = КарточкаОрганизации.Руководитель.Должность;
	оПодвал.Параметры.Руководитель = КарточкаОрганизации.Руководитель.ДляПечати;
	оПодвал.Параметры.Контрагент = КарточкаКонтрагента.Представление;
	оПодвал.Параметры.КонтрагентДолжность = КарточкаКонтрагента.Руководитель.Должность;
	оПодвал.Параметры.КонтрагентРуководитель = КарточкаКонтрагента.Руководитель.ДляПечати;
	Если КонечныйОстатокКт > 0 Тогда
		ТекстСверки = "2. Долг " + Док.Организация + " в валюте " + Валюта + " " + 
				КонечныйОстатокКт + " (" + Справочники.Валюты.СформироватьСуммуПрописью(КонечныйОстатокКт, Валюта, Перечисления.Локализации.fr_CA) + ")";
	ИначеЕсли КонечныйОстатокДт > 0 Тогда
		ТекстСверки = "2. Долг " + КарточкаКонтрагента.НаименованиеПолное + " в валюте " + Валюта + " " + 
				КонечныйОстатокДт + " (" + Справочники.Валюты.СформироватьСуммуПрописью(КонечныйОстатокДт, Валюта, Перечисления.Локализации.fr_CA) + ")";
	Иначе
		ТекстСверки = "2. Задолженность отсутствует."
	Конецесли;
	оПодвал.Параметры.ИтогСверки = ТекстСверки;
	Если ВыводитьПечать Тогда
		ДиаметрПечати = Док.Организация.ПечатьОрганизацииДиаметр;		
		оПечать = оПодвал.Рисунки.Печать;
		оПечать.Картинка = Новый Картинка(Док.Организация.ПечатьОрганизации.Получить());
		ВыводПечатныхФорм.РассчитатьРазмерИРасположениеКартинки(оПечать, ДиаметрПечати, ДиаметрПечати, 50, 0, Таб.МасштабПечати);		
		Если ЗначениеЗаполнено(КарточкаОрганизации.Руководитель.ОтветственноеЛицо) Тогда		
			ОЛ = КарточкаОрганизации.Руководитель.ОтветственноеЛицо;
			оПодписьРуководителя = оПодвал.Рисунки.Подпись;
			оПодписьРуководителя.Картинка = Новый Картинка(ОЛ.Подпись.Получить());			
			ВыводПечатныхФорм.РассчитатьРазмерИРасположениеКартинки(оПодписьРуководителя, ОЛ.ПодписьШирина, ОЛ.ПодписьВысота, 30, 20, Таб.МасштабПечати);
		КонецЕсли;
	КонецЕсли;
	Таб.Вывести(оПодвал); 	
КонецПроцедуры

#КонецОбласти

#Область EMail

Процедура ОтправитьАктыСверокКонтрагентам(МасДокументы) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	УчётнаяЗапись = Константы.УчётнаяЗаписьРассылкиСообщенийСистемы.Получить();
	Если Не ЗначениеЗаполнено(УчётнаяЗапись) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("fr = 'Aucun compte de messagerie sélectionné'; ru = 'Не выбрана учётная запись рассылки сообщений'; en = 'The message distribution account is not selected'; es = 'No se ha seleccionado la cuenta de envío de mensajes'"));
		Возврат;
	КонецЕсли;
	ТипКО = ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.EMail;
	НазначениеРассылки = Перечисления.НазначенияРассылок.Бухгалтерия;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СверкаВзаиморасчётов.Ссылка КАК Ссылка,
	                      |	СверкаВзаиморасчётов.Дата КАК Дата,
	                      |	СверкаВзаиморасчётов.Номер КАК Номер,
	                      |	СверкаВзаиморасчётов.Контрагент КАК Контрагент,
	                      |	СверкаВзаиморасчётов.Организация КАК Организация
	                      |ИЗ
	                      |	Документ.СверкаВзаиморасчётов КАК СверкаВзаиморасчётов
	                      |ГДЕ
	                      |	СверкаВзаиморасчётов.Ссылка В(&Док)");
	Запрос.УстановитьПараметр("Док", МасДокументы);
	ТЗДокументы = Запрос.Выполнить().Выгрузить();
	ТЗКонтактнаяИнформация = РегистрыСведений.РеквизитыКонтрагентов.ПолучитьКонтактнуюИнформацию(ТЗДокументы.ВыгрузитьКолонку("Контрагент"), ТипКО, НазначениеРассылки);	
	Для Каждого Стр Из ТЗДокументы Цикл		 
		// Адресаты
		МасАдреса = РегистрыСведений.РеквизитыКонтрагентов.ПолучитьКонтактнуюИнформациюПоТипу(Стр.Контрагент, ТипКО, НазначениеРассылки, ТЗКонтактнаяИнформация);
		Если МасАдреса.Количество() = 0 Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru = 'Не заполнены адреса по документу - '; fr = 'Adresses non renseignées sur le document -'") + СокрЛП(Стр.Ссылка));
			Возврат;
		КонецЕсли;
		// Формируем
		МасВложения = Новый Массив;
		Каталог = КаталогВременныхФайлов();
		ТемаПисьма = СокрЛП(Стр.Организация) + Нстр("fr = '- Rapport de rapprochement N°.'; ru = ' - Акт сверки №'; en = ' - Reconciliation Report No.'; es = ' - Ley de conciliación no.'") + Стр.Номер + Нстр("ru = ' от '; fr = ' du '") + Формат(Стр.Дата, "ДФ=dd.MM.yyyy");
		Таб = Новый ТабличныйДокумент;
		Документы.СверкаВзаиморасчётов.ПечатьАктСверки(Стр.Ссылка, Таб); 
		ИмяФайла = ОбщегоНазначенияКлиентСервер.ОбработатьИмяФайла(СокрЛП(Стр.Ссылка) + ".pdf");
		АдресВложения = Каталог + ИмяФайла;
		Таб.Записать(АдресВложения, ТипФайлаТабличногоДокумента.PDF);
		МасВложения.Добавить(АдресВложения);
		// Отправляем 		
		Результат = РаботаСЭлектроннойПочтой.ОтправитьСообщение(УчётнаяЗапись, МасАдреса, ТемаПисьма, "", МасВложения);
		Сообщить(Результат.Описание);
		// Удаляем временные файлы
		Для Каждого Вложение Из МасВложения Цикл
			УдалитьФайлы(Вложение);
		КонецЦикла;
	КонецЦикла;	
КонецПроцедуры	

#КонецОбласти

#Область Данные

Функция ПолучитьОстаткиИОборотыПоКонтрагенту(Организация, Контрагент, Договор = Неопределено, НачалоПериода, КонецПериода, ПоДаннымОрганизации = Истина) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВЗ.Контрагент КАК Контрагент,
	                      |	СУММА(ВЗ.НачальныйОстаток) КАК НачальныйОстаток,
	                      |	ВЗ.Приход КАК Приход,
	                      |	ВЗ.Расход КАК Расход,
	                      |	СУММА(ВЗ.КонечныйОстаток) КАК КонечныйОстаток
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		Покупатели.Контрагент КАК Контрагент,
	                      |		Покупатели.СуммаНачальныйОстаток КАК НачальныйОстаток,
	                      |		Покупатели.СуммаКонечныйОстаток КАК КонечныйОстаток,
	                      |		Покупатели.СуммаПриход КАК Приход,
	                      |		Покупатели.СуммаРасход КАК Расход
	                      |	ИЗ
	                      |		РегистрНакопления.ВзаиморасчётыСПокупателями.ОстаткиИОбороты(
	                      |				&НачалоПериода,
	                      |				&КонецПериода,
	                      |				,
	                      |				,
	                      |				Организация = &Организация
	                      |					И Контрагент В ИЕРАРХИИ (&Контрагент)
	                      |					И ВЫБОР
	                      |						КОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыСКонтрагентами.ПустаяСсылка)
	                      |							ТОГДА ИСТИНА
	                      |						ИНАЧЕ Договор = &Договор
	                      |					КОНЕЦ) КАК Покупатели
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		Поставщики.Контрагент,
	                      |		Поставщики.СуммаНачальныйОстаток,
	                      |		Поставщики.СуммаКонечныйОстаток,
	                      |		Поставщики.СуммаПриход,
	                      |		Поставщики.СуммаРасход
	                      |	ИЗ
	                      |		РегистрНакопления.ВзаиморасчётыСПоставщиками.ОстаткиИОбороты(
	                      |				&НачалоПериода,
	                      |				&КонецПериода,
	                      |				,
	                      |				,
	                      |				Организация = &Организация
	                      |					И Контрагент В ИЕРАРХИИ (&Контрагент)
	                      |					И ВЫБОР
	                      |						КОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыСКонтрагентами.ПустаяСсылка)
	                      |							ТОГДА ИСТИНА
	                      |						ИНАЧЕ Договор = &Договор
	                      |					КОНЕЦ) КАК Поставщики) КАК ВЗ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВЗ.Контрагент,
	                      |	ВЗ.Приход,
	                      |	ВЗ.Расход
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ВЗ.Контрагент.Наименование
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВЗ.Контрагент КАК Контрагент,
	                      |	ВЗ.Дата КАК Дата,
	                      |	ВЗ.ДокументРегистратор КАК ДокументРегистратор,
	                      |	ВЗ.Дебет КАК Дебет,
	                      |	ВЗ.Кредит КАК Кредит
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		Покупатели.Контрагент КАК Контрагент,
	                      |		Покупатели.Регистратор.Дата КАК Дата,
	                      |		Покупатели.Регистратор КАК ДокументРегистратор,
	                      |		СУММА(Покупатели.СуммаПриход) КАК Дебет,
	                      |		СУММА(Покупатели.СуммаРасход) КАК Кредит
	                      |	ИЗ
	                      |		РегистрНакопления.ВзаиморасчётыСПокупателями.Обороты(
	                      |				&НачалоПериода,
	                      |				&КонецПериода,
	                      |				Регистратор,
	                      |				Организация = &Организация
	                      |					И Контрагент В ИЕРАРХИИ (&Контрагент)
	                      |					И ВЫБОР
	                      |						КОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыСКонтрагентами.ПустаяСсылка)
	                      |							ТОГДА ИСТИНА
	                      |						ИНАЧЕ Договор = &Договор
	                      |					КОНЕЦ) КАК Покупатели
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		Покупатели.Регистратор,
	                      |		Покупатели.Контрагент,
	                      |		Покупатели.Регистратор.Дата
	                      |		
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		Поставщики.Контрагент,
	                      |		Поставщики.ОбъектРасчётов.Дата,
	                      |		Поставщики.ОбъектРасчётов,
	                      |		СУММА(Поставщики.СуммаПриход),
	                      |		СУММА(Поставщики.СуммаРасход)
	                      |	ИЗ
	                      |		РегистрНакопления.ВзаиморасчётыСПоставщиками.Обороты(
	                      |				&НачалоПериода,
	                      |				&КонецПериода,
	                      |				Регистратор,
	                      |				Организация = &Организация
	                      |					И Контрагент В ИЕРАРХИИ (&Контрагент)
	                      |					И ВЫБОР
	                      |						КОГДА &Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыСКонтрагентами.ПустаяСсылка)
	                      |							ТОГДА ИСТИНА
	                      |						ИНАЧЕ Договор = &Договор
	                      |					КОНЕЦ) КАК Поставщики
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		Поставщики.Контрагент,
	                      |		Поставщики.ОбъектРасчётов,
	                      |		Поставщики.ОбъектРасчётов.Дата) КАК ВЗ
	                      |ГДЕ
	                      |	(ВЗ.Дебет <> 0
	                      |			ИЛИ ВЗ.Кредит <> 0)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Дата");
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Договор", ?(ЗначениеЗаполнено(Договор), Договор, Справочники.ДоговорыСКонтрагентами.ПустаяСсылка()));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));	
	Возврат Запрос.ВыполнитьПакет();
КонецФункции

#КонецОбласти
